[
  {
    "id": 0,
    "plik": "czapa_1",
    "cena": 2150,
    "nazwa": ["Żółta Czapa","Yellow Hat"],
    "opis": ["Interesujący wybór. Croco powiedział że ten kolor kojarzy mu się ze słońcem. Ciekawe czemu...",
      "Interesting choise, Croco said that this color reminds him of sun. I wonder why.."],
    "waluta": "Crococoin"
  },
  {
    "id": 1,
    "plik": "czapa_2",
    "cena": 2150,
    "nazwa": ["Zielona Czapa","Green Hat"],
    "opis": ["Zielony kolor oznacza spokój. Czy myślisz że po zakupie tej czapki Croco da ci spokój od testów? Oj nie nie...",
      "Green color means peace. Do you really think that after buying this hat Croco will leave you alone from tests? Of course not."],
    "waluta": "Crococoin"
  },
  {
    "id": 2,
    "plik": "czapa_3",
    "cena": 2150,
    "nazwa": ["Niebieska Czapa","Blue Hat"],
    "opis": ["Croco mówi że można przyjąć wybór niebieskiej czapki za symbol wpływającej do głowy wiedzy. Oby nie było jakiegoś wycieku",
      "Croco says that choice of a blue hat can be taken as a symbol of knowledge flowing into the head. Let's hope there isn't any leakage"],
    "waluta": "Crococoin"
  },
  {
    "id": 3,
    "plik": "czapa_4",
    "cena": 3200,
    "nazwa": ["Kucharska Czapa","Cooking Hat"],
    "opis": ["Crobert Crokłowicz na pokładzie. Pora ugotować jakieś mózgi!",
      "Crocdor Ramsay on the board. Let's cook some brains!"],
    "waluta": "Crococoin"
  },
  {
    "id": 4,
    "plik": "czapa_5",
    "cena": 3950,
    "nazwa": ["Słomiany Kapelusz","Straw hat"],
    "opis": ["Halo Halo! Słomiany kapelusz to nie przepustka do wakacji. Wracaj szybko do uczenia się! Migiem",
      "Hey Hey! Straw hat isn't a pass for holidays. Come back to learning! Quickly!"],
    "waluta": "Crococoin"
  },
  {
    "id": 5,
    "plik": "czapa_6",
    "cena": 3950,
    "nazwa": ["Czapka Magik","Magic Hat"],
    "opis": ["Kupienie tej czapki da ci +120 punktów mocy umiejętności, ale nie wyczaruje lepszych wyników. Leć się uczyć",
      "Buying this hat will grant you +120 points of magic, but doesn't grant better outcomes. Go back to learning"],
    "waluta": "Crococoin"
  },
  {
    "id": 6,
    "plik": "czapa_7",
    "cena": 3200,
    "nazwa": ["Cowboy Czapa","Cowboy Hat"],
    "opis": ["Teraz stajesz się potęgą, niszczycielem matematyki, buahaha...",
      "Now you are becoming the power, the destroyer of math, buahaha..."],
    "waluta": "Crococoin",
    "czyPremium": true
  },
  {
    "id": 7,
    "plik": "czapa_8",
    "cena": 4300,
    "nazwa": ["Czarna Czapa","Black Hat"],
    "opis": ["Mimo czapki kucharskiej, w tej czapce Croco bardziej wygląda na kucharza",
      "Despite of the Cooking hat, in this hat Croco looks more like a cook."],
    "waluta": "Crococoin"
  },
  {
    "id": 8,
    "plik": "czapa_7",
    "cena": 4300,
    "nazwa": ["Niedostępna Czapka","Unavilable Hat"],
    "opis": ["Tej czapki nie da się kupić"],
    "waluta": "Crococoin",
    "czyDostepne": false
  }
]